In [1]:
import pandas as pd
import sqlalchemy

In [2]:
engine = sqlalchemy.create_engine('mysql+pymysql://root:12345@localhost:3306/janaeshwar')

In [6]:
df = pd.read_sql_table('table1',engine)

In [7]:
df

Empty DataFrame
Columns: [id, name]
Index: []

In [11]:
# intialise data of lists. 
data = {'name':['Tom', 'nick', 'krish', 'jack'], 
        'id':[20, 21, 19, 18]} 
  
# Create DataFrame 
d = pd.DataFrame(data)

In [12]:
d

    name  id
0    Tom  20
1   nick  21
2  krish  19
3   jack  18

In [17]:
d.to_sql(name='table1',con=engine,index=False,if_exists='append')

In [19]:
d['name']

0      Tom
1     nick
2    krish
3     jack
Name: name, dtype: object